<template>
  <tc-page>
    <template slot="animation">
      <tc-animation />
    </template>
    <template slot="main">
      <p>
        普通がすごい嫌いな感じで生きてきて、普通を追い求める人生のような気がする、ことがある。
      </p>
      <p>
        普通ってなんか、まあこれでいいんじゃない？って思えるラインっぽい気がする。あまり考えなくてもよくなるライン。
        憧れる。
      </p>
      <p>
        最初はまずその普通っていうラインを求めて頑張るんだけど、
        そのラインに到達すると、急になんかテンション下がって、逆にそれを否定したくなる。
        それ以上頑張れないみたいな、ひがみかもしれない。
      </p>
      <p>
        そして普通って思ってたもののほぼ全て、結局自分から見えている範囲でしか判断できていなかったっぽい。
        まあつまり身近にあるものが、なんとなく嫌いっていう思春期みたいな発想でかなりの人生を過ごしてきたっぽい。
      </p>
      <p>
        普通がすごく嫌で進学しなかったんだけど、
        それは進学校だったからで、もし進学校じゃなかったら進学していたような気がする。
      </p>
      <p>
        建築現場や運送とかの身体を使う仕事をしてたから、ホワイトカラーになれた気がする。
      </p>
      <p>
        みんなが管理とか設計とかやっててプログラム書いてなかったから、プログラムが書けるようになった気がする。
      </p>
      <p>
        っていうことは今の状況だと環境を変えないと新しい展開が生まれないのかもしれないな。。。
      </p>
      <p>
        年齢的にはかなり難しいけどなんとかしよっと。
      </p>
    </template>
  </tc-page>
</template>

<script>
import TcPage from '../components/tc_page.vue'
import TcAnimation from '../components/animations/2020070701.vue'

export default {
  components: {
    'tc-page': TcPage,
    'tc-animation': TcAnimation
  }
}
</script>
