<template>
  <tc-page>
    <template slot="animation">
      <tc-animation />
    </template>
    <template slot="main">
      <p>
        これは超マジメな話なんですけど、目標設定とかあるじゃないですか。
      </p>
      <p>
        僕はこれまで自分の人生っていうの？なんか漠然と生きている中で、長期と中期の目標を割としっかりと立てていたようです。
        長期が10年くらい、中期が1〜3年くらいで。
      </p>
      <p>
        具体的には、外で働いていたときに室内で働きたい、とか、トラック運転手だったけどプログラマになりたいとか、
        自分の会社をつくりたいとか、なんかそんなの。目標っていうか夢かもしれん。
        でもギリギリ実現可能っぽいものを選択しているセコさはあるな。
      </p>
      <p>
        で、最近ジジジジイになってきて、長期の目標マジわからん。
        中期はある、今の目の前にある問題を解決する的なやつ。いくつかある。けっこうある。
      </p>
      <p>
        長期がない。夢ない。夢くれ。
      </p>
      <p>
        反発的な気持ちが欲しいのか？と思うけど、ムカつくことも減ってきた。
        ムカつくジジイも友達から生まれてきて単純にムカつけない。
        ムカつくジジイに褒められたりするし、怒られなくなった。
      </p>
      <p>
        おいやべえよ、こえええよ、夢くれ、夢くれよ。
      </p>
      <p>
        10年くらいのちょうどいいやつがない、ほんとに怖い。これじゃあなんとなく生きてしまう。いや今までもそうだけども。
      </p>
      <p>
        まあいっか、なんとなく生きよう。まあいっかー。おわり。
      </p>
      <p>
        アニメーションは前のと同じ、なんかコーディングするテンションにならなかった、アイデアはなくもないけど。
      </p>
      </p>
    </template>
  </tc-page>
</template>

<script>
import TcPage from '../components/tc_page.vue'
import TcAnimation from '../components/animations/2020080501.vue'

export default {
  components: {
    'tc-page': TcPage,
    'tc-animation': TcAnimation
  }
}
</script>
